# Homework - SQL1

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 1번은 20점 나머지는 10점**

아래는 학생과 수업에 관련된 데이터베이스 테이블이다. 

![image.png](attachment:image.png)

In [ ]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
!pip install pymysql

Requirement already satisfied: pymysql in /usr/local/lib/python3.6/dist-packages (0.10.1)

### Use your host, id, and password

··········

'Connected: admin@'

### Create your univdb database and use it

In [ ]:
%%sql

DROP DATABASE IF EXISTS univdb;
CREATE DATABASE IF NOT EXISTS univdb;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
6 rows affected.
1 rows affected.

[]

In [ ]:
%sql USE univdb;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
0 rows affected.

[]

#### 1.  관계형 데이터베이스 테이블 스키마(create table)을 생성하고, MySQL DBMS를 이용하여 테이블을 생성하시오. 

- 테이블은 적절한 컬럼 데이터 타입, Primary Key, Foreign Key (on delete, on update rule 포함, restrict, set null, cascade), 필요하다면 Unique, NOT NULL 등이 표시되어야 한다. 

- 조건: 선수과목 정보는 course 정보 때문에 유지하는 정보이다. 즉, Course가 삭제되면, 불필요한 정보이다.
- 스키마 작성시 9번 문제가 성공할 수 있도록 스키마를 작성하여야 한다.

- Semester은 enum type을 사용하여, 봄, 여름, 가을, 겨울 순서가 되게 한다.
- Grade는 enum type을 사용하여 A, B, C, D, F 순서가 되게 한다.

In [ ]:
%%sql
--20
DROP TABLE IF EXISTS GRADE_REPORT;
DROP TABLE IF EXISTS STUDENT;
DROP TABLE IF EXISTS PREREQUISITE;
DROP TABLE IF EXISTS SECTION;
DROP TABLE IF EXISTS COURSE;

CREATE TABLE STUDENT
(       Name VARCHAR(15) NOT NULL,    
        Student_number INT NOT NULL,
        Class INT NOT NULL,
        Major VARCHAR(15) NOT NULL,
        PRIMARY KEY(Student_number)
) ENGINE=InnoDB;

CREATE TABLE COURSE
(       Course_name VARCHAR(30) NOT NULL,
        Course_number VARCHAR(10),
        Credit_hours INT NOT NULL,
        Department CHAR(10) NOT NULL,
        PRIMARY KEY(Course_number)
) ENGINE=InnoDB;

CREATE TABLE SECTION
(       Section_identifier INT NOT NULL,
        Course_number VARCHAR(10) NOT NULL,
        Semester ENUM('Spring', 'Summer', 'Fall', 'Winter'),
        Year CHAR(2) NOT NULL,
        Instructor VARCHAR(15) NOT NULL,
        PRIMARY KEY(Section_identifier),
        FOREIGN KEY(Course_number)
                REFERENCES COURSE(Course_number)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

CREATE TABLE PREREQUISITE
(       Course_number CHAR(10) NOT NULL,
        Prerequisite_number CHAR(10) NOT NULL,
        PRIMARY KEY (Course_number, Prerequisite_number),
        FOREIGN KEY (Course_number)
                REFERENCES COURSE(Course_number)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY (Prerequisite_number)
                REFERENCES COURSE(Course_number)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;


CREATE TABLE GRADE_REPORT
(       Student_number INT NOT NULL,
        Section_identifier INT NOT NULL,
        Grade ENUM('A', 'B', 'C', 'D', 'E', 'F'),
        PRIMARY KEY(Student_number, Section_identifier),
        FOREIGN KEY(Student_number)
                REFERENCES STUDENT(Student_number)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY(Section_identifier)
                REFERENCES SECTION(Section_identifier)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

#### 2. 각 테이블에 위에 테이블에 주어진 행들을 “insert into”를 이용하여 행들을 삽입하시오. Select \* from <table_name>를 이용하여 삽입의 성공 여부를 확인하시오.

In [ ]:
%%sql
--10
insert into STUDENT values ('Smith', 17, 1, 'CS');
insert into STUDENT values ('Brown', 8, 2, 'CS');

insert into COURSE values ('Intro to Computer Science', 'CS1310', 4, 'CS');
insert into COURSE values ('Data Structures', 'CS3320', 4, 'CS');
insert into COURSE values ('Discrete Mathematics', 'MATH2410', 3, 'MATH');
insert into COURSE values ('Database', 'CS3380', 3, 'CS');

insert into SECTION values (85, 'MATH2410', 'Fall', '07', 'King');
insert into SECTION values (92, 'CS1310', 'Fall', '07', 'Anderson');
insert into SECTION values (102, 'CS3320', 'Spring', '08', 'Knuth');
insert into SECTION values (112, 'MATH2410', 'Fall', '08', 'Chang');
insert into SECTION values (119, 'CS1310', 'Fall', '08', 'Anderson');
insert into SECTION values (135, 'CS3380', 'Fall', '08', 'Stone');

insert into GRADE_REPORT values (17, 112, 'B');
insert into GRADE_REPORT values (17, 119, 'C');
insert into GRADE_REPORT values (8, 85, 'A');
insert into GRADE_REPORT values (8, 92, 'A');
insert into GRADE_REPORT values (8, 102, 'B');
insert into GRADE_REPORT values (8, 135, 'A');

insert into PREREQUISITE values ('CS3380', 'CS3320');
insert into PREREQUISITE values ('CS3380', 'MATH2410');
insert into PREREQUISITE values ('CS3320', 'CS1310');

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from STUDENT;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
2 rows affected.

[('Brown', 8, 2, 'CS'), ('Smith', 17, 1, 'CS')]

In [ ]:
%sql select * from COURSE;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[('Intro to Computer Science', 'CS1310', 4, 'CS'),
 ('Data Structures', 'CS3320', 4, 'CS'),
 ('Database', 'CS3380', 3, 'CS'),
 ('Discrete Mathematics', 'MATH2410', 3, 'MATH')]

In [ ]:
%sql select * from SECTION;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[(85, 'MATH2410', 'Fall', '07', 'King'),
 (92, 'CS1310', 'Fall', '07', 'Anderson'),
 (102, 'CS3320', 'Spring', '08', 'Knuth'),
 (112, 'MATH2410', 'Fall', '08', 'Chang'),
 (119, 'CS1310', 'Fall', '08', 'Anderson'),
 (135, 'CS3380', 'Fall', '08', 'Stone')]

In [ ]:
%sql select * from GRADE_REPORT;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
6 rows affected.

[(8, 85, 'A'),
 (8, 92, 'A'),
 (8, 102, 'B'),
 (8, 135, 'A'),
 (17, 112, 'B'),
 (17, 119, 'C')]

In [ ]:
%sql select * from PREREQUISITE;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('CS3320', 'CS1310'), ('CS3380', 'CS3320'), ('CS3380', 'MATH2410')]

#### 3. Database 과목을 수강한 학생들의 이름을 나열하시오.

In [ ]:
%%sql
--10
SELECT Name
FROM COURSE, SECTION, STUDENT, GRADE_REPORT
WHERE Course_name = 'Database' AND COURSE.Course_number = SECTION.Course_number AND SECTION.Section_identifier = GRADE_REPORT.Section_identifier AND GRADE_REPORT.Student_number = STUDENT.Student_number;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 4. Grade_report테이블에 <8, 112, NULL> 행을 삽입하시오. 동일한 과목(course)을 두 번 이상 수강한 학생의 이름을 찾으시오.

In [ ]:
%sql insert into GRADE_REPORT values (8, 112, NULL);

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

In [ ]:
%%sql
--10
SELECT DISTINCT Name
FROM GRADE_REPORT G, GRADE_REPORT R, SECTION S, SECTION T, STUDENT
WHERE G.Section_identifier = S.Section_identifier
AND R.Section_identifier = T.Section_identifier
AND S.Course_number = T.Course_number
AND G.Student_number = R.Student_number
AND G.Section_identifier != R.Section_identifier
AND STUDENT.Student_number = G.Student_number

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown',)]

#### 5. Database 과목을 듣기 위해 (직접 또는 간접적으로: directly or indirectly) 미리 들어야 하는(prerequisite) 과목(Course_name)들을 모두 나열하시오. (Prerequisite는 Acyclic graph이고 path의 최대 길이는 3이라고 가정함. 길이 3: A-B-C-D)

In [ ]:
%%sql
--0
SELECT DISTINCT S.Course_name
FROM PREREQUISITE P1, PREREQUISITE P2, PREREQUISITE P3, COURSE C, COURSE S
WHERE C.Course_name = 'Database'
AND (
    ((P1.Course_number = C.Course_number) AND (P1.Prerequisite_number = P3.Prerequisite_number))
OR  ((P2.Course_number = P1.Prerequisite_number) AND (P2.Prerequisite_number = P3.Prerequisite_number))
OR  ((P3.Course_number = P2.Prerequisite_number))
)
AND P3.Prerequisite_number = S.Course_number

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
3 rows affected.

[('Intro to Computer Science',),
 ('Data Structures',),
 ('Discrete Mathematics',)]

#### 6. 전공으로 수강한 과목들만 나열하는 MAJOR_GRADE_REPORT테이블을 만드시오. 테이블을 생성하고, GRADE_REPORT 테이블에서 전공으로 수강한 경우에 해당하는 행들만 아래 테이블에 삽입하시오. 전공으로 수강하였다는 것은 학생의 전공(Major)과 COURSE의 개설 Department가 같으면 전공으로 수강한 과목이다.
   
    MAJOR_GRADE_REPORT(Student_number, Section_identifier, Grade)

In [ ]:
%%sql
--10
DROP TABLE IF EXISTS MAJOR_GRADE_REPORT;

CREATE TABLE MAJOR_GRADE_REPORT
(       Student_number INT NOT NULL,
        Section_identifier INT NOT NULL,
        Grade ENUM('A', 'B', 'C', 'D', 'E', 'F'),
        PRIMARY KEY(Student_number, Section_identifier),
        FOREIGN KEY(Student_number)
                REFERENCES STUDENT(Student_number)
                ON DELETE CASCADE
                ON UPDATE CASCADE,
        FOREIGN KEY(Section_identifier)
                REFERENCES SECTION(Section_identifier)
                ON DELETE CASCADE
                ON UPDATE CASCADE
) ENGINE=InnoDB;

insert into MAJOR_GRADE_REPORT
SELECT DISTINCT G.Student_number, G.Section_identifier, G.Grade
FROM STUDENT, GRADE_REPORT G, COURSE, SECTION
WHERE STUDENT.Major = COURSE.Department
AND (COURSE.Course_number = SECTION.Course_number)
AND (G.Section_identifier = SECTION.Section_identifier)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
0 rows affected.
0 rows affected.
4 rows affected.

[]

### Run the following cell to show that insert is correctly done

In [ ]:
%sql select * from MAJOR_GRADE_REPORT;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
4 rows affected.

[(8, 92, 'A'), (8, 102, 'B'), (8, 135, 'A'), (17, 119, 'C')]

#### 7. 모든 학생들의 성적들을 다음과 같이 출력하려 한다. 적절한 SQL문을 작성하여 실행하시오. 
- 결과 테이블은 Major, Student_number, Year, Semester, Course_number 순서로 정렬되어야 한다.
- 결과 테이블 애트리뷰트 이름 및 순서: (Major, Student_number, Student_name, Year, Semester, Course_number, Course_name, Grade)

In [ ]:
%%sql
--10
SELECT DISTINCT Major, ST.Student_number, Name, Year, Semester, C.Course_number, Course_name, Grade
FROM STUDENT ST, COURSE C, SECTION S, GRADE_REPORT G
WHERE ST.Student_number = G.Student_number
AND G.Section_identifier = S.Section_identifier
AND C.Course_number = S.Course_number
ORDER BY Major, Student_number, Year, Semester, C.Course_number

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
7 rows affected.

[('CS', 8, 'Brown', '07', 'Fall', 'CS1310', 'Intro to Computer Science', 'A'),
 ('CS', 8, 'Brown', '07', 'Fall', 'MATH2410', 'Discrete Mathematics', 'A'),
 ('CS', 8, 'Brown', '08', 'Spring', 'CS3320', 'Data Structures', 'B'),
 ('CS', 8, 'Brown', '08', 'Fall', 'CS3380', 'Database', 'A'),
 ('CS', 8, 'Brown', '08', 'Fall', 'MATH2410', 'Discrete Mathematics', None),
 ('CS', 17, 'Smith', '08', 'Fall', 'CS1310', 'Intro to Computer Science', 'C'),
 ('CS', 17, 'Smith', '08', 'Fall', 'MATH2410', 'Discrete Mathematics', 'B')]

#### 8. Brown이 수강한 Database 과목의 학점을 F로 수정하시오.

In [ ]:
%%sql
--10
UPDATE GRADE_REPORT
SET Grade = 'F'
WHERE (Student_number, Section_identifier) in (
    SELECT tmp.Student_number, tmp.Section_identifier
    FROM (
        SELECT ST.Student_number,S.Section_identifier
        FROM STUDENT ST, GRADE_REPORT G, COURSE C, SECTION S
        WHERE C.Course_number = S.Course_number 
        AND S.Section_identifier = G.Section_identifier
        AND ST.Student_number = G.Student_number 
        AND ST.Name = 'Brown'
        AND C.Course_name = 'Database')tmp
)

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from GRADE_REPORT where Student_number = 8 and Section_identifier = 135;

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[(8, 135, 'F')]

#### 9. Brown의 학번을 8번에서 9번으로 수정하시오. 반드시 update문 하나만 있어야 하며, update 문은 반드시 성공하여야 한다. 테이블의 Foreign Key 선언문을 삭제하면 안됨.

In [ ]:
%%sql
--10
UPDATE STUDENT
SET Student_number = 9
WHERE Name = 'Brown'

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[]

### Run the following cell to show that update is correctly done

In [ ]:
%sql select * from STUDENT where name = 'Brown';

 * mysql+pymysql://admin:***@yeeundb.cqxj696ehu1o.us-east-1.rds.amazonaws.com:3306/
1 rows affected.

[('Brown', 9, 2, 'CS')]